---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DisplacementPathDepth
source: html/d9219c3e-ba34-8e6b-5171-25a5646be650.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DisplacementPathDepth Property

"Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId DisplacementPathDepth { get; }
```